export interface NewsItem {
  description: string;
  id: string;
  title: string;
}

export const mockNews: NewsItem[] = [
  {
    id: "1",
    title: "Новость 1",
    description: "Длинное описание новости 1 от производителя о новых акциях и предложениях.",
  },
  {
    id: "2",
    title: "Новость 2",
    description: "Длинное описание новости 2 от производителя о новых акциях и предложениях.",
  },
  {
    id: "3",
    title: "Новость 3",
    description: "Длинное описание новости 3 от производителя о новых акциях и предложениях.",
  },
  {
    id: "4",
    title: "Новость 4",
    description: "Длинное описание новости 4 от производителя о новых акциях и предложениях.",
  },
  {
    id: "5",
    title: "Новость 5",
    description: "Длинное описание новости 5 от производителя о новых акциях и предложениях.",
  },
  {
    id: "6",
    title: "Новость 6",
    description: "Длинное описание новости 6 от производителя о новых акциях и предложениях.",
  },
  {
    id: "7",
    title: "Новость 7",
    description: "Длинное описание новости 7 от производителя о новых акциях и предложениях.",
  },
  {
    id: "8",
    title: "Новость 8",
    description: "Длинное описание новости 8 от производителя о новых акциях и предложениях.",
  },
];
